k = input("Введите k: ")
l = input("Введите l: ")
m = input("Введите m: ")
n = input("Введите n: ")
print("Введённые координаты: (" + k + "," + l + ") ; (" + m + "," + n + ")")
if (int(k) + int(l)) % 2 == 0:
    print("Поле (" + k + "," + l + ") является белым")
else:
    print("Поле (" + k + "," + l + ") является черным")
if (int(m) + int(n)) % 2 == 0:
    print("Поле (" + m + "," + n + ") является белым")
else:
    print("Поле (" + m + "," + n + ") является черным")

w = input("Введите название фигуры (Ферзь, Ладья, Слон, Конь): ")
if w == "Слон":
    if (k == m and l != n) or (k != m and l == n):
        print("С поля (" + k + "," + l + ") слон угрожает полю (" + m + "," + n + ")")
    else:
        print("С поля (" + k + "," + l + ") слон не угрожает полю (" + m + "," + n + ")")

if w == "Ладья":
    if (abs(int(k) - int(m))) == (abs(int(l) - int(n))):
        print("С поля (" + k + "," + l + ") ладья угрожает полю (" + m + "," + n + ")")
    else:
        print("С поля (" + k + "," + l + ") ладья не угрожает полю (" + m + "," + n + ")")

if w == "Конь":
    if ((abs(int(k) - int(m))) == 2 and (abs(int(l) - int(n))) == 1) or ((abs(int(k) - int(m))) == 1 and (abs(int(l) - int(n))) == 2):
        print("С поля (" + k + "," + l + ") конь угрожает полю (" + m + "," + n + ")")
    else:
        print("С поля (" + k + "," + l + ") конь не угрожает полю (" + m + "," + n + ")")

if w == "Ферзь":
    if ((abs(int(k) - int(m))) == (abs(int(l) - int(n)))) or ((k == m and l != n) or (k != m and l == n)):
        print("С поля (" + k + "," + l + ") Ферзь угрожает полю (" + m + "," + n + ")")
    else:
        print("С поля (" + k + "," + l + ") Ферзь не угрожает полю (" + m + "," + n + ")")